Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/codegentemp/TIMER_BUTTON.h
/*******************************************************************************
* File Name: TIMER_BUTTON.h
* Version 2.80
*
*  Description:
*     Contains the function prototypes and constants available to the timer
*     user module.
*
*   Note:
*     None
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#if !defined(CY_TIMER_TIMER_BUTTON_H)
#define CY_TIMER_TIMER_BUTTON_H

#include "cytypes.h"
#include "cyfitter.h"
#include "CyLib.h" /* For CyEnterCriticalSection() and CyExitCriticalSection() functions */

extern uint8 TIMER_BUTTON_initVar;

/* Check to see if required defines such as CY_PSOC5LP are available */
/* They are defined starting with cy_boot v3.0 */
#if !defined (CY_PSOC5LP)
    #error Component Timer_v2_80 requires cy_boot v3.0 or later
#endif /* (CY_ PSOC5LP) */


/**************************************
*           Parameter Defaults
**************************************/

#define TIMER_BUTTON_Resolution                 8u
#define TIMER_BUTTON_UsingFixedFunction         1u
#define TIMER_BUTTON_UsingHWCaptureCounter      0u
#define TIMER_BUTTON_SoftwareCaptureMode        0u
#define TIMER_BUTTON_SoftwareTriggerMode        0u
#define TIMER_BUTTON_UsingHWEnable              1u
#define TIMER_BUTTON_EnableTriggerMode          0u
#define TIMER_BUTTON_InterruptOnCaptureCount    0u
#define TIMER_BUTTON_RunModeUsed                0u
#define TIMER_BUTTON_ControlRegRemoved          0u

#if defined(TIMER_BUTTON_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG)
    #define TIMER_BUTTON_UDB_CONTROL_REG_REMOVED            (0u)
#elif  (TIMER_BUTTON_UsingFixedFunction)
    #define TIMER_BUTTON_UDB_CONTROL_REG_REMOVED            (0u)
#else 
    #define TIMER_BUTTON_UDB_CONTROL_REG_REMOVED            (1u)
#endif /* End TIMER_BUTTON_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG */


/***************************************
*       Type defines
***************************************/


/**************************************************************************
 * Sleep Wakeup Backup structure for Timer Component
 *************************************************************************/
typedef struct
{
    uint8 TimerEnableState;
    #if(!TIMER_BUTTON_UsingFixedFunction)

        uint8 TimerUdb;
        uint8 InterruptMaskValue;
        #if (TIMER_BUTTON_UsingHWCaptureCounter)
            uint8 TimerCaptureCounter;
        #endif /* variable declarations for backing up non retention registers in CY_UDB_V1 */

        #if (!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED)
            uint8 TimerControlRegister;
        #endif /* variable declaration for backing up enable state of the Timer */
    #endif /* define backup variables only for UDB implementation. Fixed function registers are all retention */

}TIMER_BUTTON_backupStruct;


/***************************************
*       Function Prototypes
***************************************/

void    TIMER_BUTTON_Start(void) ;
void    TIMER_BUTTON_Stop(void) ;

void    TIMER_BUTTON_SetInterruptMode(uint8 interruptMode) ;
uint8   TIMER_BUTTON_ReadStatusRegister(void) ;
/* Deprecated function. Do not use this in future. Retained for backward compatibility */
#define TIMER_BUTTON_GetInterruptSource() TIMER_BUTTON_ReadStatusRegister()

#if(!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED)
    uint8   TIMER_BUTTON_ReadControlRegister(void) ;
    void    TIMER_BUTTON_WriteControlRegister(uint8 control) ;
#endif /* (!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED) */

uint8  TIMER_BUTTON_ReadPeriod(void) ;
void    TIMER_BUTTON_WritePeriod(uint8 period) ;
uint8  TIMER_BUTTON_ReadCounter(void) ;
void    TIMER_BUTTON_WriteCounter(uint8 counter) ;
uint8  TIMER_BUTTON_ReadCapture(void) ;
void    TIMER_BUTTON_SoftwareCapture(void) ;

#if(!TIMER_BUTTON_UsingFixedFunction) /* UDB Prototypes */
    #if (TIMER_BUTTON_SoftwareCaptureMode)
        void    TIMER_BUTTON_SetCaptureMode(uint8 captureMode) ;
    #endif /* (!TIMER_BUTTON_UsingFixedFunction) */

    #if (TIMER_BUTTON_SoftwareTriggerMode)
        void    TIMER_BUTTON_SetTriggerMode(uint8 triggerMode) ;
    #endif /* (TIMER_BUTTON_SoftwareTriggerMode) */

    #if (TIMER_BUTTON_EnableTriggerMode)
        void    TIMER_BUTTON_EnableTrigger(void) ;
        void    TIMER_BUTTON_DisableTrigger(void) ;
    #endif /* (TIMER_BUTTON_EnableTriggerMode) */


    #if(TIMER_BUTTON_InterruptOnCaptureCount)
        void    TIMER_BUTTON_SetInterruptCount(uint8 interruptCount) ;
    #endif /* (TIMER_BUTTON_InterruptOnCaptureCount) */

    #if (TIMER_BUTTON_UsingHWCaptureCounter)
        void    TIMER_BUTTON_SetCaptureCount(uint8 captureCount) ;
        uint8   TIMER_BUTTON_ReadCaptureCount(void) ;
    #endif /* (TIMER_BUTTON_UsingHWCaptureCounter) */

    void TIMER_BUTTON_ClearFIFO(void) ;
#endif /* UDB Prototypes */

/* Sleep Retention APIs */
void TIMER_BUTTON_Init(void)          ;
void TIMER_BUTTON_Enable(void)        ;
void TIMER_BUTTON_SaveConfig(void)    ;
void TIMER_BUTTON_RestoreConfig(void) ;
void TIMER_BUTTON_Sleep(void)         ;
void TIMER_BUTTON_Wakeup(void)        ;


/***************************************
*   Enumerated Types and Parameters
***************************************/

/* Enumerated Type B_Timer__CaptureModes, Used in Capture Mode */
#define TIMER_BUTTON__B_TIMER__CM_NONE 0
#define TIMER_BUTTON__B_TIMER__CM_RISINGEDGE 1
#define TIMER_BUTTON__B_TIMER__CM_FALLINGEDGE 2
#define TIMER_BUTTON__B_TIMER__CM_EITHEREDGE 3
#define TIMER_BUTTON__B_TIMER__CM_SOFTWARE 4



/* Enumerated Type B_Timer__TriggerModes, Used in Trigger Mode */
#define TIMER_BUTTON__B_TIMER__TM_NONE 0x00u
#define TIMER_BUTTON__B_TIMER__TM_RISINGEDGE 0x04u
#define TIMER_BUTTON__B_TIMER__TM_FALLINGEDGE 0x08u
#define TIMER_BUTTON__B_TIMER__TM_EITHEREDGE 0x0Cu
#define TIMER_BUTTON__B_TIMER__TM_SOFTWARE 0x10u


