Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/codegentemp/TIMER_BUTTON.h
/***************************************
*    Initialial Parameter Constants
***************************************/

#define TIMER_BUTTON_INIT_PERIOD             149u
#define TIMER_BUTTON_INIT_CAPTURE_MODE       ((uint8)((uint8)1u << TIMER_BUTTON_CTRL_CAP_MODE_SHIFT))
#define TIMER_BUTTON_INIT_TRIGGER_MODE       ((uint8)((uint8)0u << TIMER_BUTTON_CTRL_TRIG_MODE_SHIFT))
#if (TIMER_BUTTON_UsingFixedFunction)
    #define TIMER_BUTTON_INIT_INTERRUPT_MODE (((uint8)((uint8)1u << TIMER_BUTTON_STATUS_TC_INT_MASK_SHIFT)) | \
                                                  ((uint8)((uint8)0 << TIMER_BUTTON_STATUS_CAPTURE_INT_MASK_SHIFT)))
#else
    #define TIMER_BUTTON_INIT_INTERRUPT_MODE (((uint8)((uint8)1u << TIMER_BUTTON_STATUS_TC_INT_MASK_SHIFT)) | \
                                                 ((uint8)((uint8)0 << TIMER_BUTTON_STATUS_CAPTURE_INT_MASK_SHIFT)) | \
                                                 ((uint8)((uint8)0 << TIMER_BUTTON_STATUS_FIFOFULL_INT_MASK_SHIFT)))
#endif /* (TIMER_BUTTON_UsingFixedFunction) */
#define TIMER_BUTTON_INIT_CAPTURE_COUNT      (2u)
#define TIMER_BUTTON_INIT_INT_CAPTURE_COUNT  ((uint8)((uint8)(1u - 1u) << TIMER_BUTTON_CTRL_INTCNT_SHIFT))


/***************************************
*           Registers
***************************************/

#if (TIMER_BUTTON_UsingFixedFunction) /* Implementation Specific Registers and Register Constants */


    /***************************************
    *    Fixed Function Registers
    ***************************************/

    #define TIMER_BUTTON_STATUS         (*(reg8 *) TIMER_BUTTON_TimerHW__SR0 )
    /* In Fixed Function Block Status and Mask are the same register */
    #define TIMER_BUTTON_STATUS_MASK    (*(reg8 *) TIMER_BUTTON_TimerHW__SR0 )
    #define TIMER_BUTTON_CONTROL        (*(reg8 *) TIMER_BUTTON_TimerHW__CFG0)
    #define TIMER_BUTTON_CONTROL2       (*(reg8 *) TIMER_BUTTON_TimerHW__CFG1)
    #define TIMER_BUTTON_CONTROL2_PTR   ( (reg8 *) TIMER_BUTTON_TimerHW__CFG1)
    #define TIMER_BUTTON_RT1            (*(reg8 *) TIMER_BUTTON_TimerHW__RT1)
    #define TIMER_BUTTON_RT1_PTR        ( (reg8 *) TIMER_BUTTON_TimerHW__RT1)

    #if (CY_PSOC3 || CY_PSOC5LP)
        #define TIMER_BUTTON_CONTROL3       (*(reg8 *) TIMER_BUTTON_TimerHW__CFG2)
        #define TIMER_BUTTON_CONTROL3_PTR   ( (reg8 *) TIMER_BUTTON_TimerHW__CFG2)
    #endif /* (CY_PSOC3 || CY_PSOC5LP) */
    #define TIMER_BUTTON_GLOBAL_ENABLE  (*(reg8 *) TIMER_BUTTON_TimerHW__PM_ACT_CFG)
    #define TIMER_BUTTON_GLOBAL_STBY_ENABLE  (*(reg8 *) TIMER_BUTTON_TimerHW__PM_STBY_CFG)

    #define TIMER_BUTTON_CAPTURE_LSB         (* (reg16 *) TIMER_BUTTON_TimerHW__CAP0 )
    #define TIMER_BUTTON_CAPTURE_LSB_PTR       ((reg16 *) TIMER_BUTTON_TimerHW__CAP0 )
    #define TIMER_BUTTON_PERIOD_LSB          (* (reg16 *) TIMER_BUTTON_TimerHW__PER0 )
    #define TIMER_BUTTON_PERIOD_LSB_PTR        ((reg16 *) TIMER_BUTTON_TimerHW__PER0 )
    #define TIMER_BUTTON_COUNTER_LSB         (* (reg16 *) TIMER_BUTTON_TimerHW__CNT_CMP0 )
    #define TIMER_BUTTON_COUNTER_LSB_PTR       ((reg16 *) TIMER_BUTTON_TimerHW__CNT_CMP0 )


    /***************************************
    *    Register Constants
    ***************************************/

    /* Fixed Function Block Chosen */
    #define TIMER_BUTTON_BLOCK_EN_MASK                     TIMER_BUTTON_TimerHW__PM_ACT_MSK
    #define TIMER_BUTTON_BLOCK_STBY_EN_MASK                TIMER_BUTTON_TimerHW__PM_STBY_MSK

    /* Control Register Bit Locations */
    /* Interrupt Count - Not valid for Fixed Function Block */
    #define TIMER_BUTTON_CTRL_INTCNT_SHIFT                  0x00u
    /* Trigger Polarity - Not valid for Fixed Function Block */
    #define TIMER_BUTTON_CTRL_TRIG_MODE_SHIFT               0x00u
    /* Trigger Enable - Not valid for Fixed Function Block */
    #define TIMER_BUTTON_CTRL_TRIG_EN_SHIFT                 0x00u
    /* Capture Polarity - Not valid for Fixed Function Block */
    #define TIMER_BUTTON_CTRL_CAP_MODE_SHIFT                0x00u
    /* Timer Enable - As defined in Register Map, part of TMRX_CFG0 register */
    #define TIMER_BUTTON_CTRL_ENABLE_SHIFT                  0x00u

    /* Control Register Bit Masks */
    #define TIMER_BUTTON_CTRL_ENABLE                        ((uint8)((uint8)0x01u << TIMER_BUTTON_CTRL_ENABLE_SHIFT))

    /* Control2 Register Bit Masks */
    /* As defined in Register Map, Part of the TMRX_CFG1 register */
    #define TIMER_BUTTON_CTRL2_IRQ_SEL_SHIFT                 0x00u
    #define TIMER_BUTTON_CTRL2_IRQ_SEL                      ((uint8)((uint8)0x01u << TIMER_BUTTON_CTRL2_IRQ_SEL_SHIFT))

    #if (CY_PSOC5A)
        /* Use CFG1 Mode bits to set run mode */
        /* As defined by Verilog Implementation */
        #define TIMER_BUTTON_CTRL_MODE_SHIFT                 0x01u
        #define TIMER_BUTTON_CTRL_MODE_MASK                 ((uint8)((uint8)0x07u << TIMER_BUTTON_CTRL_MODE_SHIFT))
    #endif /* (CY_PSOC5A) */
    #if (CY_PSOC3 || CY_PSOC5LP)
        /* Control3 Register Bit Locations */
        #define TIMER_BUTTON_CTRL_RCOD_SHIFT        0x02u
        #define TIMER_BUTTON_CTRL_ENBL_SHIFT        0x00u
        #define TIMER_BUTTON_CTRL_MODE_SHIFT        0x00u

        /* Control3 Register Bit Masks */
        #define TIMER_BUTTON_CTRL_RCOD_MASK  ((uint8)((uint8)0x03u << TIMER_BUTTON_CTRL_RCOD_SHIFT)) /* ROD and COD bit masks */
        #define TIMER_BUTTON_CTRL_ENBL_MASK  ((uint8)((uint8)0x80u << TIMER_BUTTON_CTRL_ENBL_SHIFT)) /* HW_EN bit mask */
        #define TIMER_BUTTON_CTRL_MODE_MASK  ((uint8)((uint8)0x03u << TIMER_BUTTON_CTRL_MODE_SHIFT)) /* Run mode bit mask */

        #define TIMER_BUTTON_CTRL_RCOD       ((uint8)((uint8)0x03u << TIMER_BUTTON_CTRL_RCOD_SHIFT))
        #define TIMER_BUTTON_CTRL_ENBL       ((uint8)((uint8)0x80u << TIMER_BUTTON_CTRL_ENBL_SHIFT))
    #endif /* (CY_PSOC3 || CY_PSOC5LP) */

    /*RT1 Synch Constants: Applicable for PSoC3 and PSoC5LP */
    #define TIMER_BUTTON_RT1_SHIFT                       0x04u
    /* Sync TC and CMP bit masks */
    #define TIMER_BUTTON_RT1_MASK                        ((uint8)((uint8)0x03u << TIMER_BUTTON_RT1_SHIFT))
    #define TIMER_BUTTON_SYNC                            ((uint8)((uint8)0x03u << TIMER_BUTTON_RT1_SHIFT))
    #define TIMER_BUTTON_SYNCDSI_SHIFT                   0x00u
    /* Sync all DSI inputs with Mask  */
    #define TIMER_BUTTON_SYNCDSI_MASK                    ((uint8)((uint8)0x0Fu << TIMER_BUTTON_SYNCDSI_SHIFT))
    /* Sync all DSI inputs */
    #define TIMER_BUTTON_SYNCDSI_EN                      ((uint8)((uint8)0x0Fu << TIMER_BUTTON_SYNCDSI_SHIFT))

