Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/codegentemp/TIMER_BUTTON.h
    #define TIMER_BUTTON_CTRL_MODE_PULSEWIDTH            ((uint8)((uint8)0x01u << TIMER_BUTTON_CTRL_MODE_SHIFT))
    #define TIMER_BUTTON_CTRL_MODE_PERIOD                ((uint8)((uint8)0x02u << TIMER_BUTTON_CTRL_MODE_SHIFT))
    #define TIMER_BUTTON_CTRL_MODE_CONTINUOUS            ((uint8)((uint8)0x00u << TIMER_BUTTON_CTRL_MODE_SHIFT))

    /* Status Register Bit Locations */
    /* As defined in Register Map, part of TMRX_SR0 register */
    #define TIMER_BUTTON_STATUS_TC_SHIFT                 0x07u
    /* As defined in Register Map, part of TMRX_SR0 register, Shared with Compare Status */
    #define TIMER_BUTTON_STATUS_CAPTURE_SHIFT            0x06u
    /* As defined in Register Map, part of TMRX_SR0 register */
    #define TIMER_BUTTON_STATUS_TC_INT_MASK_SHIFT        (TIMER_BUTTON_STATUS_TC_SHIFT - 0x04u)
    /* As defined in Register Map, part of TMRX_SR0 register, Shared with Compare Status */
    #define TIMER_BUTTON_STATUS_CAPTURE_INT_MASK_SHIFT   (TIMER_BUTTON_STATUS_CAPTURE_SHIFT - 0x04u)

    /* Status Register Bit Masks */
    #define TIMER_BUTTON_STATUS_TC                       ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_TC_SHIFT))
    #define TIMER_BUTTON_STATUS_CAPTURE                  ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_CAPTURE_SHIFT))
    /* Interrupt Enable Bit-Mask for interrupt on TC */
    #define TIMER_BUTTON_STATUS_TC_INT_MASK              ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_TC_INT_MASK_SHIFT))
    /* Interrupt Enable Bit-Mask for interrupt on Capture */
    #define TIMER_BUTTON_STATUS_CAPTURE_INT_MASK         ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_CAPTURE_INT_MASK_SHIFT))

#else   /* UDB Registers and Register Constants */


    /***************************************
    *           UDB Registers
    ***************************************/

    #define TIMER_BUTTON_STATUS              (* (reg8 *) TIMER_BUTTON_TimerUDB_rstSts_stsreg__STATUS_REG )
    #define TIMER_BUTTON_STATUS_MASK         (* (reg8 *) TIMER_BUTTON_TimerUDB_rstSts_stsreg__MASK_REG)
    #define TIMER_BUTTON_STATUS_AUX_CTRL     (* (reg8 *) TIMER_BUTTON_TimerUDB_rstSts_stsreg__STATUS_AUX_CTL_REG)
    #define TIMER_BUTTON_CONTROL             (* (reg8 *) TIMER_BUTTON_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG )
    
    #if(TIMER_BUTTON_Resolution <= 8u) /* 8-bit Timer */
        #define TIMER_BUTTON_CAPTURE_LSB         (* (reg8 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
        #define TIMER_BUTTON_CAPTURE_LSB_PTR       ((reg8 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
        #define TIMER_BUTTON_PERIOD_LSB          (* (reg8 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
        #define TIMER_BUTTON_PERIOD_LSB_PTR        ((reg8 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
        #define TIMER_BUTTON_COUNTER_LSB         (* (reg8 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
        #define TIMER_BUTTON_COUNTER_LSB_PTR       ((reg8 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
    #elif(TIMER_BUTTON_Resolution <= 16u) /* 8-bit Timer */
        #if(CY_PSOC3) /* 8-bit addres space */
            #define TIMER_BUTTON_CAPTURE_LSB         (* (reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
            #define TIMER_BUTTON_CAPTURE_LSB_PTR       ((reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
            #define TIMER_BUTTON_PERIOD_LSB          (* (reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
            #define TIMER_BUTTON_PERIOD_LSB_PTR        ((reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
            #define TIMER_BUTTON_COUNTER_LSB         (* (reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
            #define TIMER_BUTTON_COUNTER_LSB_PTR       ((reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
        #else /* 16-bit address space */
            #define TIMER_BUTTON_CAPTURE_LSB         (* (reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__16BIT_F0_REG )
            #define TIMER_BUTTON_CAPTURE_LSB_PTR       ((reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__16BIT_F0_REG )
            #define TIMER_BUTTON_PERIOD_LSB          (* (reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__16BIT_D0_REG )
            #define TIMER_BUTTON_PERIOD_LSB_PTR        ((reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__16BIT_D0_REG )
            #define TIMER_BUTTON_COUNTER_LSB         (* (reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__16BIT_A0_REG )
            #define TIMER_BUTTON_COUNTER_LSB_PTR       ((reg16 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__16BIT_A0_REG )
        #endif /* CY_PSOC3 */
    #elif(TIMER_BUTTON_Resolution <= 24u)/* 24-bit Timer */
        #define TIMER_BUTTON_CAPTURE_LSB         (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
        #define TIMER_BUTTON_CAPTURE_LSB_PTR       ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
        #define TIMER_BUTTON_PERIOD_LSB          (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
        #define TIMER_BUTTON_PERIOD_LSB_PTR        ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
        #define TIMER_BUTTON_COUNTER_LSB         (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
        #define TIMER_BUTTON_COUNTER_LSB_PTR       ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
    #else /* 32-bit Timer */
        #if(CY_PSOC3 || CY_PSOC5) /* 8-bit address space */
            #define TIMER_BUTTON_CAPTURE_LSB         (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
            #define TIMER_BUTTON_CAPTURE_LSB_PTR       ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__F0_REG )
            #define TIMER_BUTTON_PERIOD_LSB          (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
            #define TIMER_BUTTON_PERIOD_LSB_PTR        ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__D0_REG )
            #define TIMER_BUTTON_COUNTER_LSB         (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
            #define TIMER_BUTTON_COUNTER_LSB_PTR       ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
        #else /* 32-bit address space */
            #define TIMER_BUTTON_CAPTURE_LSB         (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__32BIT_F0_REG )
            #define TIMER_BUTTON_CAPTURE_LSB_PTR       ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__32BIT_F0_REG )
            #define TIMER_BUTTON_PERIOD_LSB          (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__32BIT_D0_REG )
            #define TIMER_BUTTON_PERIOD_LSB_PTR        ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__32BIT_D0_REG )
            #define TIMER_BUTTON_COUNTER_LSB         (* (reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__32BIT_A0_REG )
            #define TIMER_BUTTON_COUNTER_LSB_PTR       ((reg32 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__32BIT_A0_REG )
        #endif /* CY_PSOC3 || CY_PSOC5 */ 
    #endif

