Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/codegentemp/TIMER_BUTTON.h
    #define TIMER_BUTTON_COUNTER_LSB_PTR_8BIT       ((reg8 *) TIMER_BUTTON_TimerUDB_sT8_timerdp_u0__A0_REG )
    
    #if (TIMER_BUTTON_UsingHWCaptureCounter)
        #define TIMER_BUTTON_CAP_COUNT              (*(reg8 *) TIMER_BUTTON_TimerUDB_sCapCount_counter__PERIOD_REG )
        #define TIMER_BUTTON_CAP_COUNT_PTR          ( (reg8 *) TIMER_BUTTON_TimerUDB_sCapCount_counter__PERIOD_REG )
        #define TIMER_BUTTON_CAPTURE_COUNT_CTRL     (*(reg8 *) TIMER_BUTTON_TimerUDB_sCapCount_counter__CONTROL_AUX_CTL_REG )
        #define TIMER_BUTTON_CAPTURE_COUNT_CTRL_PTR ( (reg8 *) TIMER_BUTTON_TimerUDB_sCapCount_counter__CONTROL_AUX_CTL_REG )
    #endif /* (TIMER_BUTTON_UsingHWCaptureCounter) */


    /***************************************
    *       Register Constants
    ***************************************/

    /* Control Register Bit Locations */
    #define TIMER_BUTTON_CTRL_INTCNT_SHIFT              0x00u       /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_CTRL_TRIG_MODE_SHIFT           0x02u       /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_CTRL_TRIG_EN_SHIFT             0x04u       /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_CTRL_CAP_MODE_SHIFT            0x05u       /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_CTRL_ENABLE_SHIFT              0x07u       /* As defined by Verilog Implementation */

    /* Control Register Bit Masks */
    #define TIMER_BUTTON_CTRL_INTCNT_MASK               ((uint8)((uint8)0x03u << TIMER_BUTTON_CTRL_INTCNT_SHIFT))
    #define TIMER_BUTTON_CTRL_TRIG_MODE_MASK            ((uint8)((uint8)0x03u << TIMER_BUTTON_CTRL_TRIG_MODE_SHIFT))
    #define TIMER_BUTTON_CTRL_TRIG_EN                   ((uint8)((uint8)0x01u << TIMER_BUTTON_CTRL_TRIG_EN_SHIFT))
    #define TIMER_BUTTON_CTRL_CAP_MODE_MASK             ((uint8)((uint8)0x03u << TIMER_BUTTON_CTRL_CAP_MODE_SHIFT))
    #define TIMER_BUTTON_CTRL_ENABLE                    ((uint8)((uint8)0x01u << TIMER_BUTTON_CTRL_ENABLE_SHIFT))

    /* Bit Counter (7-bit) Control Register Bit Definitions */
    /* As defined by the Register map for the AUX Control Register */
    #define TIMER_BUTTON_CNTR_ENABLE                    0x20u

    /* Status Register Bit Locations */
    #define TIMER_BUTTON_STATUS_TC_SHIFT                0x00u  /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_STATUS_CAPTURE_SHIFT           0x01u  /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_STATUS_TC_INT_MASK_SHIFT       TIMER_BUTTON_STATUS_TC_SHIFT
    #define TIMER_BUTTON_STATUS_CAPTURE_INT_MASK_SHIFT  TIMER_BUTTON_STATUS_CAPTURE_SHIFT
    #define TIMER_BUTTON_STATUS_FIFOFULL_SHIFT          0x02u  /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_STATUS_FIFONEMP_SHIFT          0x03u  /* As defined by Verilog Implementation */
    #define TIMER_BUTTON_STATUS_FIFOFULL_INT_MASK_SHIFT TIMER_BUTTON_STATUS_FIFOFULL_SHIFT

    /* Status Register Bit Masks */
    /* Sticky TC Event Bit-Mask */
    #define TIMER_BUTTON_STATUS_TC                      ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_TC_SHIFT))
    /* Sticky Capture Event Bit-Mask */
    #define TIMER_BUTTON_STATUS_CAPTURE                 ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_CAPTURE_SHIFT))
    /* Interrupt Enable Bit-Mask */
    #define TIMER_BUTTON_STATUS_TC_INT_MASK             ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_TC_SHIFT))
    /* Interrupt Enable Bit-Mask */
    #define TIMER_BUTTON_STATUS_CAPTURE_INT_MASK        ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_CAPTURE_SHIFT))
    /* NOT-Sticky FIFO Full Bit-Mask */
    #define TIMER_BUTTON_STATUS_FIFOFULL                ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_FIFOFULL_SHIFT))
    /* NOT-Sticky FIFO Not Empty Bit-Mask */
    #define TIMER_BUTTON_STATUS_FIFONEMP                ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_FIFONEMP_SHIFT))
    /* Interrupt Enable Bit-Mask */
    #define TIMER_BUTTON_STATUS_FIFOFULL_INT_MASK       ((uint8)((uint8)0x01u << TIMER_BUTTON_STATUS_FIFOFULL_SHIFT))

    #define TIMER_BUTTON_STATUS_ACTL_INT_EN             0x10u   /* As defined for the ACTL Register */

    /* Datapath Auxillary Control Register definitions */
    #define TIMER_BUTTON_AUX_CTRL_FIFO0_CLR             0x01u   /* As defined by Register map */
    #define TIMER_BUTTON_AUX_CTRL_FIFO1_CLR             0x02u   /* As defined by Register map */
    #define TIMER_BUTTON_AUX_CTRL_FIFO0_LVL             0x04u   /* As defined by Register map */
    #define TIMER_BUTTON_AUX_CTRL_FIFO1_LVL             0x08u   /* As defined by Register map */
    #define TIMER_BUTTON_STATUS_ACTL_INT_EN_MASK        0x10u   /* As defined for the ACTL Register */

#endif /* Implementation Specific Registers and Register Constants */

#endif  /* CY_TIMER_TIMER_BUTTON_H */


/* [] END OF FILE */
